In [3]:
import pandas as pd
import numpy as np

In [4]:
pp = {'city' : ['Tripoli','Sydney','Tripoli','Rome','Rome', 'Tripoli', 'Rome', 'Sydney', 'Sydney'],
'rank': ['1st','2nd','1st','2nd','1st', '2nd', '1st', '2nd','1st'],
'score1' : [44,48,44,41,38,44,34,54,61],
'score2': [67,63,67,70,64,77,45,66,72],
}

df = pd.DataFrame(pp,
                    index= pd.Index(['A', 'B','C','D', 'E', 'F', 'G','H','I'], name='letters'),
                    columns=pd.Index(['city', 'rank',  'score1', 'score2'], name='attributes'))
df

attributes     city rank  score1  score2
letters
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      44      67
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      77
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [7]:
rows = df.shape[0]

In [9]:
# 1) change the order of the rows
b = np.random.permutation(rows)
b

array([6, 7, 0, 4, 3, 8, 5, 1, 2])

In [10]:
df.take(b)

attributes     city rank  score1  score2
letters
G              Rome  1st      34      45
H            Sydney  2nd      54      66
A           Tripoli  1st      44      67
E              Rome  1st      38      64
D              Rome  2nd      41      70
I            Sydney  1st      61      72
F           Tripoli  2nd      44      77
B            Sydney  2nd      48      63
C           Tripoli  1st      44      67

In [11]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'], dtype='object', name='letters')

In [15]:
# 2) change the order of the rows
new_order = np.random.permutation(df.index)
new_order

array(['I', 'B', 'C', 'E', 'F', 'D', 'G', 'H', 'A'], dtype=object)

In [16]:
df.reindex(new_order)

attributes     city rank  score1  score2
letters
I            Sydney  1st      61      72
B            Sydney  2nd      48      63
C           Tripoli  1st      44      67
E              Rome  1st      38      64
F           Tripoli  2nd      44      77
D              Rome  2nd      41      70
G              Rome  1st      34      45
H            Sydney  2nd      54      66
A           Tripoli  1st      44      67

In [17]:
# 3) change the order of the rows
df.sample(n=rows)

attributes     city rank  score1  score2
letters
F           Tripoli  2nd      44      77
I            Sydney  1st      61      72
E              Rome  1st      38      64
D              Rome  2nd      41      70
G              Rome  1st      34      45
C           Tripoli  1st      44      67
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
H            Sydney  2nd      54      66

In [19]:
s = df['city']
len(s)

9

In [22]:
# change the order of the one col
r_entries = np.random.permutation(len(s))
r_entries

array([3, 7, 5, 6, 8, 4, 1, 2, 0])

In [23]:
s[r_entries]

C:\Users\wq\AppData\Local\Temp\ipykernel_10620\51231547.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[r_entries]

letters
D       Rome
H     Sydney
F    Tripoli
G       Rome
I     Sydney
E       Rome
B     Sydney
C    Tripoli
A    Tripoli
Name: city, dtype: object

In [24]:
df['city'] = s[r_entries].values
df

C:\Users\wq\AppData\Local\Temp\ipykernel_10620\460883879.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['city'] = s[r_entries].values

attributes     city rank  score1  score2
letters
A              Rome  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      44      67
D              Rome  2nd      41      70
E            Sydney  1st      38      64
F              Rome  2nd      44      77
G            Sydney  1st      34      45
H           Tripoli  2nd      54      66
I           Tripoli  1st      61      72